<?php
// +----------------------------------------------------------------------
// | 错误码定义
// +----------------------------------------------------------------------
return [
    //错误码定义
    200 => '成功(Success)',
    202 => '成功(Success)',
    204 => '成功(Success)',
    302 => '重定向(Redirect)',
    401 => '未授权(Unauthorized)',
    403 => '拒绝访问(Forbidden)',
    404 => '页面不存在(Not Found)',
    //10001-10999  系统相关错误
    10000 => '无错误',
    10001 => '系统错误',
    10002 => '参数缺少',
    10003 => '配置缺少',
    10004 => '未找到内容',
    10005 => '保存失败',
    10006 => '删除失败！',

    //11001-11999 接口验证相关
    11001 => 'AppID不存在或未接入',
    11002 => 'AppID参数缺失',
    11003 => '签名参数缺失',
    11004 => '接口签名验证失败',
    11005 => '应用未找到或禁用',

    11101 => '未找到登录信息',
    11102 => '用户登录已失效,请重新登录',
    11103 => '其它设备登录',
    11104 => '用户不存在',
    11105 => '帐号或密码错误',
];
